app/Controllers/PayController.php

SELECT *
FROM `pays`
ORDER BY `p_id`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `pays`
---
    public function index()
    {
        $pay  = new PayModel();
        $data=[
            "page_title"=> "Welcome to Haque Residence",
            "page_heading"=> " Payment History",
            'pays' => $pay->orderBy('p_id',)->paginate(4, 'group'),