app/Controllers/UserController.php

    public function alluser()
    {
        $user  = new UserModel();
        $data=[
            "page_title"=> "Welcome to Haque Residence",
            "page_heading"=> " All User",
            'users' => $user->orderBy('user_id',)->paginate(4, 'group'),
---
SELECT *
FROM `user`
ORDER BY `user_id`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `user`